# Напишите программу, которая принимает на вход координаты
# двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

import math

def long(a, b):

    return round(math.sqrt(math.pow((b[0] - a[0]), 2) + math.pow((b[1] - a[1]), 2)), 2)


print('Найдём растояние между точками..')
a = [None, None]
b = [None, None]

a[0] = int(input('Точка A. Координата X: '))
a[1] = int(input('Точка A. Координата Y: '))
b[0] = int(input('Точка B. Координата X: '))
b[1] = int(input('Точка B. Координата Y: '))

print(f'Растояние между точками = {long(a, b)}')
